---
kind: method
id: M:Autodesk.Revit.UI.Macros.ApplicationEntryPoint.CreateRibbonPanel(System.String,System.String)
source: html/9480ac88-4c6c-899e-05d5-aeff3fcbd829.htm
---
# Autodesk.Revit.UI.Macros.ApplicationEntryPoint.CreateRibbonPanel Method

## Syntax (C#)
```csharp
public override RibbonPanel CreateRibbonPanel(
	string tabName,
	string panelName
)
```

## Parameters
- **tabName** (`System.String`)
- **panelName** (`System.String`)